{"posts": [{"image": "https://instagram.fgyd4-1.fna.fbcdn.net/v/t51.2885-19/s150x150/16789166_1850562905199522_1062759373580795904_a.jpg?tp=1&_nc_ht=instagram.fgyd4-1.fna.fbcdn.net&_nc_ohc=VONzelMU0bkAX9MmpD2&edm=AABBvjUAAAAA&ccb=7-4&oh=3be1e798a0574cdd4f4576333a004bb6&oe=609D793E&_nc_sid=83d603", "like": "247,230", "caption": "In Africa, our priority should be keeping people safe and getting the private sector back on its feet so we can get people back to work. The good news is that Africa’s private sector has been quite resilient. Many have changed their production facilities to produce hand sanitizer and PPE equipment, and have been able to pivot in these times of crisis.Most importantly, and the thing I’m most optimistic about, is the innovation we’re seeing. For example, a laboratory in Senegal is making testing accessible by producing one-dollar test kits that can give you results in 65 minutes. And the innovation we’re seeing in the technological space from Africa’s youth is amazing and refreshing and is key to recovering our global health and economies.Join us in a coordinated global response to #COVID19. Demand action at @ONE #passthemic #oneworld"}, {"image": "https://instagram.fgyd4-1.fna.fbcdn.net/v/t51.2885-19/s150x150/16789166_1850562905199522_1062759373580795904_a.jpg?tp=1&_nc_ht=instagram.fgyd4-1.fna.fbcdn.net&_nc_ohc=VONzelMU0bkAX9MmpD2&edm=AABBvjUAAAAA&ccb=7-4&oh=3be1e798a0574cdd4f4576333a004bb6&oe=609D793E&_nc_sid=83d603", "like": "280,170", "caption": "Thank you, Tom, I’m so glad to be here. Like Tom mentioned, my name is Dr. Vera Songwe @songwevera and I’m the United Nations Under Secretary-General and Executive Secretary of the United Nations Economic Commission for Africa.Today I want to talk about the economic impact of a coordinated global response to #COVID19. A united global response is the key to a faster recovery and unlocks the potential for more equitable growth. Tens of millions of people around the world have already lost their jobs, and we need to keep that number from growing.If we don’t come together as one, we will have a “limping recovery” where some countries take off and the rest are left struggling. We’re all interconnected, so having one country lifting off and another lagging behind is not going to help any of us. To join us in fighting for a coordinated global response to COVID-19, demand action at @ONE #passthemic #oneworld"}, {"image": "https://instagram.fgyd4-1.fna.fbcdn.net/v/t51.2885-19/s150x150/16789166_1850562905199522_1062759373580795904_a.jpg?tp=1&_nc_ht=instagram.fgyd4-1.fna.fbcdn.net&_nc_ohc=VONzelMU0bkAX9MmpD2&edm=AABBvjUAAAAA&ccb=7-4&oh=3be1e798a0574cdd4f4576333a004bb6&oe=609D793E&_nc_sid=83d603", "like": "216,286", "caption": "The #COVID19 pandemic has shone a light on the stark inequities of our health systems globally. Through my continued work with @unicef_uk I have seen first hand the failures to protect marginalized communities, especially children, and the progress that can be made when we work together. As #COVID19 continues to disproportionately affect these same exact populations, we are reminded of our responsibility to support each other as one community globally.That is why I am honoured to #PassTheMic to Dr. Vera Songwe @songwevera, the Executive Secretary of the United Nations Economic Commission for Africa. She is an expert on economics and development in Africa and globally. Today Dr. Songwe is taking over my account to talk about the large scale impact of #COVID19 in Africa and around the world, and why we all need to demand a coordinated global response from our leaders. Follow along here and in my Stories to learn more from Dr. Songwe about the challenges and opportunities we face with COVID-19.None of us are safe until all of us are safe. Join me to demand action at @ONE. #oneworld"}], "name": "Tom Hiddleston", "bio": "Actor", "website": "go.one.org/2XalGgx", "post_numbers": "49", "followers": "9m", "followings": "113"}